app/views/posts/index.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY "posts"."id" DESC  [["user_id", 1]]
---
<% @posts.each do |item| %>
	<p> <%= link_to item.post_title, current_user.posts.find(params[:id])%> </p>