app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 13], ["LIMIT", 1]]
---
	def edit
		@post = current_user.posts.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 20], ["LIMIT", 1]]
---
	def update
		@post = current_user.posts.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 14], ["LIMIT", 1]]
---
	def destroy
  	@post = current_user.posts.find(params[:id])