app/controllers/posts_controller.rb

	def index
		@posts = User.find(params[:user_id]).posts.order(id: :desc)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY "posts"."id" DESC  [["user_id", 1]]

	def show
    p params
    p "@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"
		@post = User.find(params[:user_id]).posts.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def create
    p params
    p "@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"
		@post = Post.new(post_params.merge({user_id: current_user.id}))
		if @post.save
---
INSERT INTO "posts" ("post_title", "post_description", "created_at", "updated_at", "user_id", "category_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["post_title", "hello"], ["post_description", "asdfasdfasdf"], ["created_at", "2017-08-07 23:16:57.545341"], ["updated_at", "2017-08-07 23:16:57.545341"], ["user_id", 1], ["category_id", 1]]

	def update
		@post = Post.find(params[:id])

		if @post.update(params[:id].permit(:post_title, :post_description))
---
UPDATE "posts" SET "image_file_name" = $1, "image_file_size" = $2, "image_updated_at" = $3, "updated_at" = $4 WHERE "posts"."id" = $5  [["image_file_name", "IMG_20170802_205553.jpg"], ["image_file_size", 2335146], ["image_updated_at", "2017-08-10 16:10:20.513158"], ["updated_at", "2017-08-10 16:10:25.904535"], ["id", 34]]

	def destroy
		p params
    p "@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"
    @post = Post.find(params[:id])
  	if @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 11]]

	def load_category
		@category = Category.find(params[:category_id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]