app/views/categories/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = $1  [["category_id", 1]]
---
      <% if user_signed_in? %>
        <% @category.posts.each do |post| %><br>